# 公共操作指的是，所有的数据类型都支持的操作
# 加号和乘法，不支持字典类型的
# 因为加号需要将两个对象合并到一起
# print("==================================================")
str1 = 'demo1'
str2 = 'demo2'
t3 = (1, 2)
t4 = (3, 4)
dict5 = {"dict5": "555"}
dict6 = {"dict6": "666"}
list7 = [11, 22]
list8 = [33, 44]
print("==================================================")
str_total = str1 + str2
print(str_total)  # demo1demo2
print("==================================================")
t_total = t3 + t4
print(t_total)  # (1, 2, 3, 4)
print("==================================================")
# dict_total = dict5 + dict6
# print(dict_total)
# 直接合并会报错
list_total = list7 + list8
print(list_total)  # [11, 22, 33, 44]
print("==================================================")
