print("==================================================")
list1 = [(i, j) for i in range(1, 5) for j in range(3)]
print(list1)
# [(1, 0), (1, 1), (1, 2), (2, 0), (2, 1), (2, 2), (3, 0), (3, 1), (3, 2), (4, 0), (4, 1), (4, 2)]
# 每个独立的数据组是这个：(4, 0), (4, 1), (4, 2)
# 相当于，i是外部的循环，然后j是内部的循环
# 分别遍历次数是4和3
list2 = [(j, i) for i in range(1, 5) for j in range(3)]
print(list2)
# [(0, 1), (1, 1), (2, 1), (0, 2), (1, 2), (2, 2), (0, 3), (1, 3), (2, 3), (0, 4), (1, 4), (2, 4)]
# 对调顺序以后，每个独立的组是：(0, 4), (1, 4), (2, 4)
# 所以相当于，for的顺序和循环次数无关
# 组装的时候，还是按照参数的顺序来执行的
# 这里有点类似于乘法交换律
# m*n=n*m
print(type(list2[0]))  # <class 'tuple'>
# 内部是元组类型的数据组成的列表
