str1 = 'demo1'
t3 = (1, 2)
dict5 = {"dict5": "555"}
list7 = [11, 22]
# 乘号表示复制的意思
print("==================================================")
str_total = str1 * 5
print(str_total)  # demo1demo1demo1demo1demo1
print("==================================================")
t_total = t3 * 5
print(t_total)  # (1, 2, 1, 2, 1, 2, 1, 2, 1, 2)
# 实际上，乘号，表示的是多个数据同时连接，然后赋值给原数据
print("==================================================")
# dict_total = dict5 * 5
# print(dict_total)
# 直接合并会报错
list_total = list7 * 5
print(list_total)  # [11, 22, 11, 22, 11, 22, 11, 22, 11, 22]
print("==================================================")
