str1 = 'demo1'
str2 = 'demo2'
t3 = (1, 2)
t4 = (3, 4)
dict5 = {"dict5": "555"}
dict6 = {"dict6": "666"}
list7 = [11, 22]
list8 = [33, 44]
print("==================================================")
print(len(str1))  # 5
print("==================================================")
print(len(t3))  # 2
print("==================================================")
print(len(dict5))  # 1
print("==================================================")
print(len(list7))  # 2
print("==================================================")
del str2  # 括号是冗余的
# print(str2)  # 对于不存在的数据，直接打印会报错
del t3
# del t3[0] #doesn't support item deletion
# print(t3)
# 不能指定元素来删除，但是可以整个元组同时删除
print("==================================================")
