demo = "demo show me the money junw 123456 show"

demo.replace("junw", "new str")
print(demo)  # 这里还是不变的
print("==================================================")
replace = demo.replace("junw", "new str")
print(replace)  # 这里就是新的字符串
# 这里也说明，我们的字符串是不可变类型
# 类似于java中的new String
# 可以理解为，字符串作为一个整体进入了内存中，是一个独立的对象
# 但是取代后的字符串，是新建了一个字符串对象，而不是在原有的基础上修改
# 从这个角度来看，python中的数据就是可变类型和不可变类型的数据
print("==================================================")
demo_replace = demo.replace("show", "****")
print(demo_replace)  # 在不说明的情况下,默认是替换所有出现的字符串
print("==================================================")
demo_replace1 = demo.replace("show", "****", 1)
print(demo_replace1)  # 可以指定替换的次数,没有说明的情况下,替换寻找到的第一个字符串
print("==================================================")
print("==================================================")
print("==================================================")
