demo = "111aaa111asd111 sss111ddd"
split = demo.split("111")  # 直接分割是返回一个列表
print(split)  # ['', 'aaa', 'asd', ' sss', 'ddd']
split2 = demo.split("111", 2)  # 只分割两次，就只会选择前面的两个拆分，后面的作为一个独立的字符串出现
print(split2)  # ['', 'aaa', 'asd111 sss111ddd']
print("==================================================")
# demo2 = [11, 22, 33, 44]  # 对于数字组成的字符串会报错
demo2 = ["11", "22", "33", "44"]
result = "...".join(demo2)
print(result)  # 11...22...33...44
# join就是用指定的连接符，合并字符串组成的数组
print("==================================================")
# demo3 = ["11", 22, "33", "44"]  # 对于多个类型的数组，直接拼接也会报错
# result3 = "...".join(demo3)
# print(result3)
