# 导入模块的时候，不能和已有模块名称重复，否则会导致无法调用
# 同时，类似random，如果定义了一个random模块，但是又在代码中调用了一次
# 那么就会使用最后一个定义的模块——也就是我们手动定义出来的random模块
def sleep():
    print("我是手动定义的sleep模块")


print("==================================================")

import time
from time import sleep

print(time)  # <module 'time' (built-in)>
# 打印的是内置的模块
print("==================================================")
time = 22
print(time)  # 函数都是通过引用方式完成传递的
# 但是这里，也是能进行覆盖

print("==================================================")
sleep(2)  # 根据调用顺序，使用的是后面定义出来的函数
